tiborsimon/embedded-tdd-headers/pic/8bit/pic18f47j53_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F47J53_H_
#define _PIC18F47J53_H_

#define ADCTRIG                       0
#define TRIGSEL                       1
#define SRC                           2
#define TRIGSEL0                      3
#define SRC0                          4
#define TRIGSEL1                      5
#define SRC1                          6
#define PMDIS0                        7
#define PMDADC                        8
#define ADCMD                         9
#define SPI1MD                        10
#define PMDMSSP                       11
#define PMDMSSP1                      12
#define SPIMD                         13
#define SPI2MD                        14
#define PMDMSSP2                      15
#define PMDUART                       16
#define PMDUART1                      17
#define UARTMD                        18
#define UART1MD                       19
#define PMDUART2                      20
#define UART2MD                       21
#define PMDECCP                       22
#define ECCP1MD                       23
#define ECCPMD                        24
#define PMDECCP1                      25
#define ECCP2MD                       26
#define PMDECCP2                      27
#define ECCP3MD                       28
#define PMDECCP3                      29
#define PMDIS1                        30
#define PMDTMR                        31
#define TMRMD                         32
#define PMDTMR1                       33
#define TMR1MD                        34
#define PMDTMR2                       35
#define TMR2MD                        36
#define PMDTMR3                       37
#define TMR3MD                        38
#define PMDTMR4                       39
#define TMR4MD                        40
#define PMDRTCC                       41
#define RTCCMD                        42
#define CTMUMD                        43
#define PMDCTMU                       44
#define PMDPSP                        45
#define PSPMD                         46
#define PMDIS2                        47
#define CMP1MD                        48
#define PMDCMP                        49
#define CMPMD                         50
#define PMDCMP1                       51
#define PMDCMP2                       52
#define CMP2MD                        53
#define CMP3MD                        54
#define PMDCMP3                       55
#define PMDTMR5                       56
#define TMR5MD                        57
#define TMR6MD                        58
#define PMDTMR6                       59
#define PMDTMR8                       60
#define TMR8MD                        61
#define PMDIS3                        62
#define CCP4MD                        63
#define PMDCCP                        64
#define PMDCCP4                       65
#define CCPMD                         66
#define PMDCCP5                       67
#define CCP5MD                        68
#define CCP6MD                        69
#define PMDCCP6                       70
#define CCP7MD                        71
#define PMDCCP7                       72
#define CCP8MD                        73
#define PMDCCP8                       74
#define PMDCCP9                       75
#define CCP9MD                        76
#define PMDCCP10                      77
#define CCP10MD                       78
#define PPSCON                        79
#define IOLOCK                        80
#define CCP10CON                      81
#define CCP10M                        82
#define CCP10M0                       83
#define CCP10M1                       84
#define CCP10M2                       85
#define CCP10M3                       86
#define DC10B0                        87
#define DC10B                         88
#define DC10B1                        89
#define CCPR10L                       90
#define CCPR10H                       91
#define CCP9CON                       92
#define CCP9M0                        93
#define CCP9M                         94
#define CCP9M1                        95
#define CCP9M2                        96
#define CCP9M3                        97
#define DC9B0                         98
#define DC9B                          99
#define DC9B1                         100
#define CCPR9L                        101
#define CCPR9H                        102
#define CCP8CON                       103
#define CCP8M0                        104
#define CCP8M                         105
#define CCP8M1                        106
#define CCP8M2                        107
#define CCP8M3                        108
#define DC8B0                         109
#define DC8B                          110
#define DC8B1                         111
#define CCPR8L                        112
#define CCPR8H                        113
#define CCP7CON                       114
#define CCP7M0                        115
#define CCP7M                         116
#define CCP7M1                        117
#define CCP7M2                        118
#define CCP7M3                        119
#define DC7B                          120
#define DC7B0                         121
#define DC7B1                         122
#define CCPR7L                        123
#define CCPR7H                        124
#define CCP6CON                       125
#define CCP6M                         126
#define CCP6M0                        127
#define CCP6M1                        128
#define CCP6M2                        129
#define CCP6M3                        130
#define DC6B0                         131
#define DC6B                          132
#define DC6B1                         133
#define CCPR6L                        134
#define CCPR6H                        135
#define CCP5CON                       136
#define CCP5M0                        137
#define CCP5M                         138
#define CCP5M1                        139
#define CCP5M2                        140
#define CCP5M3                        141
#define DC5B0                         142
#define DC5B                          143
#define DC5B1                         144
#define CCPR5L                        145
#define CCPR5H                        146
#define CCP4CON                       147
#define CCP4M                         148
#define CCP4M0                        149
#define CCP4M1                        150
#define CCP4M2                        151
#define CCP4M3                        152
#define DC4B0                         153
#define DC4B                          154
#define DC4B1                         155
#define CCPR4L                        156
#define CCPR4H                        157
#define CCP3CON                       158
#define CCP3M                         159
#define CCP3M0                        160
#define CCP3M1                        161
#define CCP3M2                        162
#define CCP3M3                        163
#define DC3B                          164
#define DC3B0                         165
#define DC3B1                         166
#define P3M                           167
#define P3M0                          168
#define P3M1                          169
#define CCPR3L                        170
#define CCPR3H                        171
#define ECCP3DEL                      172
#define P3DC                          173
#define P3DC0                         174
#define P3DC1                         175
#define P3DC2                         176
#define P3DC3                         177
#define P3DC4                         178
#define P3DC5                         179
#define P3DC6                         180
#define P3RSEN                        181
#define PSS3BD0                       182
#define PSS3BD                        183
#define PSS3BD1                       184
#define PSS3AC0                       185
#define PSS3AC                        186
#define PSS3AC1                       187
#define ECCP3AS                       188
#define ECCP3AS0                      189
#define ECCP3AS1                      190
#define ECCP3AS2                      191
#define ECCP3ASE                      192
#define PSTR3CON                      193
#define PSTR3CON_STRA                 194
#define STRA3                         195
#define STRB3                         196
#define PSTR3CON_STRB                 197
#define PSTR3CON_STRC                 198
#define STRC3                         199
#define STRD3                         200
#define PSTR3CON_STRD                 201
#define STRSYNC3                      202
#define PSTR3CON_STRSYNC              203
#define CMPL                          204
#define PSTR3CON_CMPL0                205
#define CMPL03                        206
#define CMPL13                        207
#define PSTR3CON_CMPL1                208
#define T8CON                         209
#define T8CKPS0                       210
#define T8CKPS                        211
#define T8CKPS1                       212
#define TMR8ON                        213
#define T8OUTPS                       214
#define T8OUTPS0                      215
#define T8OUTPS1                      216
#define T8OUTPS2                      217
#define T8OUTPS3                      218
#define PR8                           219
#define TMR8                          220
#define T6CON                         221
#define T6CKPS0                       222
#define T6CKPS                        223
#define T6CKPS1                       224
#define TMR6ON                        225
#define T6OUTPS0                      226
#define T6OUTPS                       227
#define T6OUTPS1                      228
#define T6OUTPS2                      229
#define T6OUTPS3                      230
#define PR6                           231
#define TMR6                          232
#define T5GCON                        233
#define T5GSS                         234
#define T5GSS0                        235
#define T5GSS1                        236
#define T5GVAL                        237
#define T5DONE                        238
#define T5GGO_NOT_T5DONE              239
#define nT5DONE                       240
#define T5GGO_nT5DONE                 241
#define NOT_T5DONE                    242
#define T5GGO                         243
#define T5GSPM                        244
#define T5GTM                         245
#define T5GPOL                        246
#define TMR5GE                        247
#define T5CON                         248
#define TMR5ON                        249
#define T5CON_RD16                    250
#define RD165                         251
#define nT5SYNC                       252
#define NOT_T5SYNC                    253
#define SOSCEN5                       254
#define T5OSCEN                       255
#define T5CKPS                        256
#define T5CKPS0                       257
#define T5CKPS1                       258
#define TMR5CS0                       259
#define TMR5CS                        260
#define TMR5CS1                       261
#define TMR5L                         262
#define TMR5H                         263
#define CM3CON                        264
#define CM3CON_CCH                    265
#define CCH03                         266
#define CM3CON_CCH0                   267
#define CCH13                         268
#define CM3CON_CCH1                   269
#define CM3CON_CREF                   270
#define CREF3                         271
#define CM3CON_EVPOL                  272
#define EVPOL03                       273
#define CM3CON_EVPOL0                 274
#define CM3CON_EVPOL1                 275
#define EVPOL13                       276
#define CM3CON_CPOL                   277
#define CPOL3                         278
#define COE3                          279
#define CM3CON_COE                    280
#define CM3CON_CON                    281
#define CON3                          282
#define UEP0                          283
#define UEP0_EPSTALL                  284
#define EP0STALL                      285
#define EPSTALL0                      286
#define UEP0_EPINEN                   287
#define EPINEN0                       288
#define EP0INEN                       289
#define UEP0_EPOUTEN                  290
#define EP0OUTEN                      291
#define EPOUTEN0                      292
#define EPCONDIS0                     293
#define EP0CONDIS                     294
#define UEP0_EPCONDIS                 295
#define UEP0_EPHSHK                   296
#define EP0HSHK                       297
#define EPHSHK0                       298
#define UEP1                          299
#define EPSTALL1                      300
#define EP1STALL                      301
#define UEP1_EPSTALL                  302
#define EPINEN1                       303
#define EP1INEN                       304
#define UEP1_EPINEN                   305
#define EPOUTEN1                      306
#define UEP1_EPOUTEN                  307
#define EP1OUTEN                      308
#define UEP1_EPCONDIS                 309
#define EP1CONDIS                     310
#define EPCONDIS1                     311
#define EPHSHK1                       312
#define EP1HSHK                       313
#define UEP1_EPHSHK                   314
#define UEP2                          315
#define EP2STALL                      316
#define EPSTALL2                      317
#define UEP2_EPSTALL                  318
#define EP2INEN                       319
#define EPINEN2                       320
#define UEP2_EPINEN                   321
#define EP2OUTEN                      322
#define UEP2_EPOUTEN                  323
#define EPOUTEN2                      324
#define EP2CONDIS                     325
#define UEP2_EPCONDIS                 326
#define EPCONDIS2                     327
#define EP2HSHK                       328
#define EPHSHK2                       329
#define UEP2_EPHSHK                   330
#define UEP3                          331
#define UEP3_EPSTALL                  332
#define EPSTALL3                      333
#define EP3STALL                      334
#define UEP3_EPINEN                   335
#define EPINEN3                       336
#define EP3INEN                       337
#define EP3OUTEN                      338
#define EPOUTEN3                      339
#define UEP3_EPOUTEN                  340
#define UEP3_EPCONDIS                 341
#define EP3CONDIS                     342
#define EPCONDIS3                     343
#define EPHSHK3                       344
#define UEP3_EPHSHK                   345
#define EP3HSHK                       346
#define UEP4                          347
#define EP4STALL                      348
#define EPSTALL4                      349
#define UEP4_EPSTALL                  350
#define UEP4_EPINEN                   351
#define EP4INEN                       352
#define EPINEN4                       353
#define UEP4_EPOUTEN                  354
#define EPOUTEN4                      355
#define EP4OUTEN                      356
#define EPCONDIS4                     357
#define EP4CONDIS                     358
#define UEP4_EPCONDIS                 359
#define EPHSHK4                       360
#define EP4HSHK                       361
#define UEP4_EPHSHK                   362
#define UEP5                          363
#define EP5STALL                      364
#define UEP5_EPSTALL                  365
#define EPSTALL5                      366
#define EPINEN5                       367
#define UEP5_EPINEN                   368
#define EP5INEN                       369
#define EPOUTEN5                      370
#define UEP5_EPOUTEN                  371
#define EP5OUTEN                      372
#define EPCONDIS5                     373
#define EP5CONDIS                     374
#define UEP5_EPCONDIS                 375
#define UEP5_EPHSHK                   376
#define EPHSHK5                       377
#define EP5HSHK                       378
#define UEP6                          379
#define EPSTALL6                      380
#define UEP6_EPSTALL                  381
#define EP6STALL                      382
#define EP6INEN                       383
#define UEP6_EPINEN                   384
#define EPINEN6                       385
#define EP6OUTEN                      386
#define EPOUTEN6                      387
#define UEP6_EPOUTEN                  388
#define UEP6_EPCONDIS                 389
#define EP6CONDIS                     390
#define EPCONDIS6                     391
#define EPHSHK6                       392
#define UEP6_EPHSHK                   393
#define EP6HSHK                       394
#define UEP7                          395
#define UEP7_EPSTALL                  396
#define EP7STALL                      397
#define EPSTALL7                      398
#define EP7INEN                       399
#define EPINEN7                       400
#define UEP7_EPINEN                   401
#define EP7OUTEN                      402
#define UEP7_EPOUTEN                  403
#define EPOUTEN7                      404
#define UEP7_EPCONDIS                 405
#define EP7CONDIS                     406
#define EPCONDIS7                     407
#define EPHSHK7                       408
#define UEP7_EPHSHK                   409
#define EP7HSHK                       410
#define UEP8                          411
#define EPSTALL8                      412
#define UEP8_EPSTALL                  413
#define UEP8_EPINEN                   414
#define EPINEN8                       415
#define UEP8_EPOUTEN                  416
#define EPOUTEN8                      417
#define UEP8_EPCONDIS                 418
#define EPCONDIS8                     419
#define UEP8_EPHSHK                   420
#define EPHSHK8                       421
#define UEP9                          422
#define EPSTALL9                      423
#define UEP9_EPSTALL                  424
#define EPINEN9                       425
#define UEP9_EPINEN                   426
#define UEP9_EPOUTEN                  427
#define EPOUTEN9                      428
#define UEP9_EPCONDIS                 429
#define EPCONDIS9                     430
#define UEP9_EPHSHK                   431
#define EPHSHK9                       432
#define UEP10                         433
#define EPSTALL10                     434
#define UEP10_EPSTALL                 435
#define EPINEN10                      436
#define UEP10_EPINEN                  437
#define UEP10_EPOUTEN                 438
#define EPOUTEN10                     439
#define EPCONDIS10                    440
#define UEP10_EPCONDIS                441
#define UEP10_EPHSHK                  442
#define EPHSHK10                      443
#define UEP11                         444
#define UEP11_EPSTALL                 445
#define EPSTALL11                     446
#define EPINEN11                      447
#define UEP11_EPINEN                  448
#define UEP11_EPOUTEN                 449
#define EPOUTEN11                     450
#define EPCONDIS11                    451
#define UEP11_EPCONDIS                452
#define UEP11_EPHSHK                  453
#define EPHSHK11                      454
#define UEP12                         455
#define EPSTALL12                     456
#define UEP12_EPSTALL                 457
#define UEP12_EPINEN                  458
#define EPINEN12                      459
#define EPOUTEN12                     460
#define UEP12_EPOUTEN                 461
#define EPCONDIS12                    462
#define UEP12_EPCONDIS                463
#define EPHSHK12                      464
#define UEP12_EPHSHK                  465
#define UEP13                         466
#define UEP13_EPSTALL                 467
#define EPSTALL13                     468
#define EPINEN13                      469
#define UEP13_EPINEN                  470
#define UEP13_EPOUTEN                 471
#define EPOUTEN13                     472
#define EPCONDIS13                    473
#define UEP13_EPCONDIS                474
#define EPHSHK13                      475
#define UEP13_EPHSHK                  476
#define UEP14                         477
#define UEP14_EPSTALL                 478
#define EPSTALL14                     479
#define EPINEN14                      480
#define UEP14_EPINEN                  481
#define UEP14_EPOUTEN                 482
#define EPOUTEN14                     483
#define EPCONDIS14                    484
#define UEP14_EPCONDIS                485
#define UEP14_EPHSHK                  486
#define EPHSHK14                      487
#define UEP15                         488
#define UEP15_EPSTALL                 489
#define EPSTALL15                     490
#define UEP15_EPINEN                  491
#define EPINEN15                      492
#define UEP15_EPOUTEN                 493
#define EPOUTEN15                     494
#define EPCONDIS15                    495
#define UEP15_EPCONDIS                496
#define UEP15_EPHSHK                  497
#define EPHSHK15                      498
#define UIE                           499
#define URSTIE                        500
#define UERRIE                        501
#define ACTVIE                        502
#define TRNIE                         503
#define IDLEIE                        504
#define STALLIE                       505
#define SOFIE                         506
#define UEIE                          507
#define PIDEE                         508
#define CRC5EE                        509
#define CRC16EE                       510
#define DFN8EE                        511
#define BTOEE                         512
#define BTSEE                         513
#define UADDR                         514
#define ADDR                          515
#define ADDR0                         516
#define ADDR1                         517
#define ADDR2                         518
#define ADDR3                         519
#define ADDR4                         520
#define ADDR5                         521
